Revit 2024 API
AdvancedTransparent.TransparentColor Property
 The property labeled "Color" from the "AdvancedTransparent" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TransparentColor { get; }
Visual Basic
Public Shared ReadOnly Property TransparentColor As String
	Get
Visual C++
public:
static property String^ TransparentColor {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
AdvancedTransparent Class
Autodesk.Revit.DB.Visual Namespace